//주석 달기~
/* 주석 여러 줄 달기~ */

parseInt("24");
prompt("안녕하세요");

// JS 활용!!
// 각각 HTML에 올리게 된다면, 하나 수정할 때 나머지를 힘들게 싹 다 수정해줘야 한다.
// 그러니 JS 파일 만들어서 한꺼번에 수정되게끔 만들어준다.
// 유지보수가 굉장히 쉬워진다. 가독성도 좋아진다.

// 라이브러리 VS 프레임워크
// 다른 사람이 만든 것을 활용할 수 있다. 다른 사람과 협력할 수 있는 도구들.
// 라이브러리? 도서관, 정리정돈, 재사용하기 쉽도록
// 프레임워크? 만들고자 하는 것이 무엇이냐에 따라서 줄 수 있는, 완제품 느낌
// jQuery! 가장 유명한 라이브러리
// 홈페이지 -> CDN -> Google CDN -> 스크립트 복사해서 HTML에 넣어주면 끝!
// 현재 JS는 빠르게 성장하는 언어 중 하나인데 이 친구의 라이브러리를 많이 알 수록 할 수 있는 것들이 많아진다.

// UI VS API
// User Interface
// Application Programming Interface - alert라는 함수를 사용할 때, 웹브라우저를 만든 사람들이 미리 만들어둔 경고창을 띄웠습니다.
// 이렇게 프로그래머들이 사용하는 조작 장치들을 API라고 부릅니다. 즉, alert는 API인 것이죠.

// 최소한의 도구만을 가지고 일단 도전하고 부딪히자!!
// document 객체
// DOM 객체
// window 객체
// ajax 현대적인 웹, 앱을 만드는데 필수적인 요소
// cookie
